

**** vertices

| x | thickness | ~0.5~           |
| y | height    | ~tube_radius~   |
| z | length    | ~tube_length/2~ |

#+BEGIN_SRC ipython :session paper :results raw drawer :noweb yes :noweb no-export

<<vertex>>
<<vertices>>

x = 0.5
y = combination_magnitude["tube_radius"]/2
z = combination_magnitude["tube_length"]/2

vertices = [Vertex(-x,-y,-z),    # - - - 
            Vertex( x,-y,-z),    #   - - 
            Vertex( x, y,-z),    #     -
            Vertex(-x, y,-z),    # -   - 
            Vertex(-x,-y, z),    # - -  
            Vertex( x,-y, z),    #   -  
            Vertex( x, y, z),    #      
            Vertex(-x, y, z)]    # -    

vertex_list = Vertices(vertices=vertices)
vertex_list
#+END_SRC

#+RESULTS:
:RESULTS:
# Out[119]:
#+BEGIN_EXAMPLE
  vertices
  (
  (-0.5 -0.9144 -10.0) // 0
  (0.5 -0.9144 -10.0) // 1
  (0.5 0.9144 -10.0) // 2
  (-0.5 0.9144 -10.0) // 3
  (-0.5 -0.9144 10.0) // 4
  (0.5 -0.9144 10.0) // 5
  (0.5 0.9144 10.0) // 6
  (-0.5 0.9144 10.0) // 7
  )
#+END_EXAMPLE
:END:


**** blocks

So in OpenFOAM, we define a block by listing its vertices in a specific order. The way that OpenFOAM orders its vertices, which is a surprisingly common way of numbering vertices, is with the bottom vertices numbered in counter-clockwise order followed by the top vertices in counter-clockwise order:
#+BEGIN_EXAMPLE
        7-------6
       /|      /|
      4-+-----5 | 
      | |     | |   y
      | 3-----+-2   | z
      |/      |/    |/
      0-------1     +--x
#+END_EXAMPLE

Since I haven't (yet) found a way to get a formula that spits out a unique-ish hexahedron given some vertices, I'm forced to make the user input all vertices in the right order (manually). However, I'll have plenty of tests to ensure that odd bugs don't appear (as much as possible). 


#+BEGIN_SRC ipython :session paper :noweb yes :noweb no-export
<<hexahedron>>
<<numberOfCells>>
numberCells = NumberOfCells(2,2,2)
block = Hexahedron(vertex_list[0],vertex_list[1],
                   vertex_list[2],vertex_list[3],
                   vertex_list[4],vertex_list[5],
                   vertex_list[6],vertex_list[7],
                   numberCells)

block
#+END_SRC

#+RESULTS:
: # Out[116]:
: : hex 0 1 2 3 4 5 6 7 (2 2 2)
***** Hexahedron
#+NAME: hexahedron
#+BEGIN_SRC python
from collections.abc import Mapping
class Hexahedron(Mapping):
    def __init__(self,v0,v1,v2,v3,v4,v5,v6,v7,numberOfCells,*args,**kw):
    
        # Tests or Assertions here to ensure that everything makes sense.
        # Will do later
        self._storage = dict(v0=v0,v1=v1,v2=v2,v3=v3,
                             v4=v4,v5=v5,v6=v6,v7=v7,
                             numberOfCells=numberOfCells,
                             *args,**kw) 
    def __getitem__(self, key):
        return self._storage[key]
    def __iter__(self):
        return iter(self._storage) 
    def __len__(self):
        return len(self._storage)
    def __repr__(self):
        list_of_vertices = [self["v0"],self["v1"],self["v2"],self["v3"],
                            self["v4"],self["v5"],self["v6"],self["v7"]]
        #print(self["v0"]["name"])
        prefix_string = "hex"
        vertex_string = " ".join([vertex["name"] for vertex in list_of_vertices])
        numberCells_string = str(self["numberOfCells"])
        return " ".join([prefix_string,vertex_string,numberCells_string])
#+END_SRC

#+RESULTS:
: # Out[113]:

